"""
Taranpreet Kaur
Trishan Mizhquiri
24/01/2024
ASIXc 1B UF1 PR5
Fer un programa de càlcul de temperatures del mar. Les tasques a fer són:
Calcular per a l’any  2022: temperatura màxima, mínima i mitjana
Calcular per període 2000 a 2022: temperatura màxima, mínima i mitjana
"""

temperatures = {
    2022: (13.6, 13.4, 13.2, 13.4, 13.9, 13.7, 13.7, 13.8, 14, 14.3, 16, 15.1),
    2021: (13.3, 12.9, 13.5, 13.5, 13.7, 13.8, 13.8, 13.8, 14.2, 14.6, 16.8, 14.7),
    2020: (14.4, 13.9, 13.6, 13.5, 13.7, 13.9, 13.9, 14, 14.3, 14.7, 15.6, 14.6),
    2019: (13.9, 12.5, 13.3, 13.4, 14, 13.9, 13.8, 13.9, 14.5, 14.9, 15.5, 15.4),
    2018: (13.2, 12.7, 12.3, 12.9, 13.8, 13.9, 14, 14.1, 14.3, 17.9, 17.7, 15.9),
    2017: (13.7, 12.8, 13.4, 13.9, 14, 14, 13.9, 14, 14, 14.6, 14.8, 13.3),
    2016: (14.1, 13.6, 12.9, 13.5, 14, 13.9, 14, 14, 14.2, 16.3, 16.5, 15.6),
    2015: (14.1, 12.6, 12.9, 13.5, 14.3, 13.9, 13.7, 13.8, 14.1, 15.8, 15.8, 15.1),
    2014: (13.7, 13.2, 13.6, 13.6, 14.7, 14.2, 13.9, 14, 14.5, 15.7, 16.5, 16),
    2013: (13.2, 12.2, 12, 13.1, 13.5, 14.1, 13.7, 13.6, 13.6, 15.3, 15.9, 13.6),
    2012: (13.9, 12.4, 12.6, 13.3, 13.7, 13.5, 13.5, 13.7, 13.9, 14.8, 15.8, 13.9),
    2011: (13, 12.5, 12.5, 13.6, 13.5, 14, 14.1, 13.7, 13.8, 15.2, 17.6, 15.9),
    2010: (12.6, 11.9, 12.2, 12.8, 13.7, 13.6, 13.5, 13.5, 13.9, 15.6, 15.5, 14),
    2009: (13.3, 12.5, 12.6, 12.8, 14.2, 13.7, 13.7, 13.8, 14, 16.2, 15.9, 14.5),
    2008: (13.2, 13, 12.9, 12.8, 13.3, 13.6, 13.7, 13.8, 13.9, 14.3, 15.5, 13.8),
    2007: (14.3, 13.4, 13.2, 13.4, 14.4, 13.8, 13.8, 13.8, 14, 15.5, 15.5, 13.9),
    2006: (12.5, 12.3, 12.1, 12.9, 13.1, 13.4, 13.2, 13.2, 14, 15.5, 17.3, 15.8),
    2005: (13.3, 12.3, 12.3, 12.9, 13.4, 13.3, 13.3, 13.4, 13.9, 15.2, 17.1, 14.4),
    2004: (13.5, 12.7, 12.3, 12.6, 13.2, 13.1, 13.3, 13.6, 14.9, 15.3, 15.4, 14.6),
    2003: (13.6, 12.2, 12.5, 12.8, 14.7, 13.5, 13.6, 13.7, 14.2, 15.9, 15.3, 15),
    2002: (13.2, 12.4, 12.9, 13.4, 13.7, 13.6, 14.4, 13.8, 14.3, 14.8, 15.3, 14.2),
    2001: (13.8, 13, 12.6, 13.6, 13.5, 13.4, 14, 14, 14.2, 15.3, 16.8, 14),
    2000: (12.7, 12.4, 12.6, 12.4, 13, 13.6, 13.3, 13.6, 13.5, 15.9, 15.3, 14.9),
}

#Para el 2022
maxima = 0
minima = 100
suma = 0
for x in temperatures[2022]:
    if x>maxima:
        maxima = x
    elif x<minima:
        minima = x
    #mitjana
    suma += x
mitjana = suma / len(temperatures[2022])
print("Any 2022")
print(f"Maxima: {maxima:.2f}")
print(f"Minima: {minima:.2f}")
print(f"Mitjana: {mitjana:.2f}")

print()

#Para la resta
maximaTotal = 0
minimaTotal = 100
sumaTotal = 0
any_inici = 2000
any_final = 2022

for any in range(any_inici, any_final + 1):
    for x in temperatures[any]:
        if x>maximaTotal:
            maximaTotal = x
        elif x<minimaTotal:
            minimaTotal = x
    #mitjana
    for x in temperatures[any]:
        sumaTotal += x
    mitjanaTotal = sumaTotal/(len(temperatures[any]) * ((any_final + 1) - any_inici))


print("Període 2000 a 2022")
print(f"Maxima: {maximaTotal:.2f}")
print(f"Minima: {minimaTotal:.2f}")
print(f"Mitjana: {mitjanaTotal:.2f}")



